# Functions

Tutorial: https://docs.python.org/3.7/tutorial/controlflow.html#defining-functions

The keyword ***def*** is used for a function definition.<br/> 
After ***def***, function name and the parenthesized list of parameters are introduced.<br/>
Any statements to be included in the function must be indented.

In [ ]:
def name_of_function(parameter1, parameter2):
    code
    code
    code
    print()

In [6]:
def sum_two_numbers(x, y):
    return x + y

In [7]:
value = sum_two_numbers(2,3)

In [9]:
type(value)

int

In [10]:
def myFunction0(x = 5, y = -2, z = -1):
    return x**2 + y*z

In [13]:
myFunction0(z=2)

21

In [14]:
def myFunction1(myInput = 1): # 1 is the default value for the input parameter
    i = 1
    while i <= myInput:
        print("Hello")
        i += 1
    print("End")

## Calling a Function

In [15]:
myFunction1() #no input parameters. default input parameter of 1 is used

Hello
End

In [16]:
myFunction1(myInput = 2) #call function with a custom input parameter value

Hello
Hello
End

In [19]:
myFunction1(3) #we really don't need to speficy an input parameter value by calling out its name

Hello
Hello
Hello
End

In [20]:
def myFunction2(myInput): #no default value is specified
    i = 1
    while i <= myInput:
        print("Hello")
        i += 1
    print("End")

In [21]:
myFunction2() #throws an error. we must specify an input value

TypeError: myFunction2() missing 1 required positional argument: 'myInput'

In [22]:
myFunction2(1)

Hello
End

In [23]:
myFunction2(myInput=3)

Hello
Hello
Hello
End

## Multiple Input Parameters

In [24]:
def myFunction3(a, b=2, c, d=4): #throws and error
    return print (a,b,c,d)

SyntaxError: non-default argument follows default argument (1474684728.py, line 1)

In [25]:
def myFunction4(b=2, d=4, a, c): #throws and error
    print(a,b,c,d)

SyntaxError: non-default argument follows default argument (3059585360.py, line 1)

### Remark:
Always put parameters with default values after those without any.<br/> 
Only in that case Python will know which arguments go into which when calling the function.

In [26]:
def myFunction4(a, c, b=2, d=4):
    print(a,b,c,d)

In [27]:
myFunction4(0,1) #prints a and b as given input values and c and d with default values

0 2 1 4

In [28]:
myFunction4(0,1,3) #a=0 b=3 and c=1 are given values

0 3 1 4

In [29]:
myFunction4(0,1,3,5) #a=0 b=3 c=1 d=5 are given values

0 3 1 5

In [31]:
myFunction4(0,1,2,3,4)

TypeError: myFunction4() takes from 2 to 4 positional arguments but 5 were given

### Remark:
When calling a function, the order does not matter as long as we specify input parameter names.

In [ ]:
def myFunction4(a, c, b=2, d=4):
    print(a,b,c,d)

In [44]:
myFunction4()

TypeError: myFunction4() missing 2 required positional arguments: 'a' and 'c'

In [33]:
myFunction4(c=1, a=55)

55 2 1 4

In [38]:
myFunction4(1, b=2, d=1, c=23)

1 2 23 1

In [39]:
 def myFunction5(a=0, b=0, c=0, d=0): #include all default arguments 
    print(a, b, c, d)

In [40]:
myFunction5()

0 0 0 0

In [41]:
myFunction5(1,2) #python will assign input parameter values from the beginning

1 2 0 0

In [42]:
myFunction5(c=2) # specifying an argument we wish to pass a value to

0 0 2 0

### Remark:

Arguments that are non-default are called "positional arguments".<br/>
The default arguments are called "keyword arguments".

• All positional parameters must be located before all keyword parameters.<br/>
• Keyword parameters may occur in any order.<br/>
• The function call must supply at least as many parameters as the function has positional arguments.<br/>
• If the caller supplies more positional parameters than the function has positional arguments, parameters are matched with keyword arguments according to their position.<br/>

## First-class Functions

In Python, functions are so-called “first-class citizens”. This means that they can be
used in the same way as variables: <br/>
They can be assigned to variables, passed to, and returned from functions, as well as stored in collections (e.g. list).

In [45]:
def myFunction6(x):
    return x ** 2 #returns square of input value

In [47]:
myFunction6(2)

4

In [48]:
myVariable = myFunction6 (12) #function value is assigned to a variable
print(myVariable)

144

In [51]:
myNewFunction = myFunction6 #function itself is assigned under a different name
print(myNewFunction(2))
print(myFunction6(2))

4
4

**Example 1:**
Let's store functions in a list and call them with an input

In [52]:
def backwards(string):# a function to print any string backwards
    print(string[::-1])

def half(string): #a function to print half of the input string
    print(string[:len(string)//2])


#create a list of functions. only use the name of the functions 
#the first entry in the list is the built-in function "print"
print_functions = [print, backwards, half] 

for func in print_functions: #calling multiple different functions with a single input
    func("Hello World!")

Hello World!
!dlroW olleH
Hello

### Remark:
The above given functionality is useful if we desire to call multiple different functions by passing a single or a set of the same inputs into.<br/>
If we desire to accomplish the other way around, meaning that if we desire to pass multiple different inputs into the same function we can use the following Python feature.

## Mapping
A common operation in Python is to call the same function for every element in a collection, such as a list or a tuple and then create a new list with the results.

Let's first accomplish this with a for loop:

In [55]:
def myFunction6(x):
    return x ** 2 #returns square of input value

myInputsList = [1, 2, 3]
my_newList = []

for x in myInputsList:
    my_newList.append(myFunction6(x)) #call the function with the elements of the given list and create a new list
print(my_newList)

[1, 4, 9]

Now let's accomplish this with map

In [57]:
list(map(myFunction6, myInputsList))

[1, 4, 9]

In [58]:
my_newList = list(map(myFunction6, myInputsList)) #only a single line does the same job!
print(my_newList)

[1, 4, 9]

Map function can take any iterable collection (i.e. list, set, tuple etc.) It returns a special Map object, which can be converted into a list.

In [64]:
a = {1.1: 2.1, 1.2: 3.6}
list(map(round, a)) #round each element of a list and return a list

[2, 4]

## Filter
filter and map are similar to each other. In filter, the input function should return either True or False. If it returns True then the given element is included in the final list.<br/>

In [65]:
def isOdd(x):
    if x % 2 == 1:
        return True
    else:
        return False

myInputsList = [1, 2, 3, 42, 568, 0, 99, 45]
my_newList = []
for x in myInputsList:
    my_newList.append(isOdd(x)) #call the function with the elements of the given list and create a new list
print(my_newList)

[True, False, True, False, False, False, True, True]

In [66]:
my_newList = []
for x in myInputsList:
    if(isOdd(x)):
        my_newList.append(x) #call the function with the elements of the given list and create a new list
print(my_newList)

[1, 3, 99, 45]

In [67]:
my_newList = list(filter(isOdd, myInputsList)) #only a single line does the same job!
print(my_newList)

[1, 3, 99, 45]

In [69]:
import numpy as np
import itertools as it

my_list = [1, float("nan") , 3] #define a nan value in a list. let's filter out nan from this list.
my_newList = list(it.filterfalse(np.isnan, my_list)) #itertools.filterfalse() function does the opposite. 
my_newList

[1, 3]

In [71]:
list(it.filterfalse(isOdd, myInputsList))

[2, 42, 568, 0]

## Lambda Functions
Lambda functions are anonymous functions that are created while the program is running and are not assigned to a name like normal functions. They can be used very similarly to normal functions if assigned to a variable:

In [81]:
def myPowerFunction(x): #we define a python function in a regular way
    return x ** 2
myPowerFunction(4)

16

In [82]:
myPowerFunction

In [85]:
lambda x: print(x**2)

In [87]:
myNewPowerFunction = lambda x: print(x**2) #we can define a python function this way, too. Just use 'lambda' word
var = myNewPowerFunction(4)

16

In [89]:
var is None

True

In [90]:
myInputsList = [1, 2, 3]
list(map(lambda x: x**2, myInputsList)) #use a build-in function

[1, 4, 9]

They are restricted to a single expression. Another use is to pass a small function as an argument.

In [94]:
myInputsList = [-1, 2, 3, -4]
sorted(myInputsList, key=lambda x: x**3)

[-4, -1, 2, 3]

In [96]:
data = [(5, 2, 4), (6, 3, 2), (4, 4, 4), (3, 3, 3), (5, 3, 10)]
sorted(data, key=lambda x: x[2]) #sort according to last element in each tuple. 
#The default value would be a function that sorts based on the first element.

[(6, 3, 2), (3, 3, 3), (5, 2, 4), (4, 4, 4), (5, 3, 10)]

In [100]:
myInputsList = [-1, 2, 3, -4]
myInputsList.sort()

In [101]:
myInputsList

[-4, -1, 2, 3]

In [103]:
pairs = [(1, 'one'), (2, 'two'), (4, 'four'), (6, 'six')]
pairs.sort(key=lambda pair: pair[0]) #sort it according to second element in each tuple
pairs

[(1, 'one'), (2, 'two'), (4, 'four'), (6, 'six')]

In [105]:
myInputsList = [1, 2, 3, 42, 568, 0, 99, 45]
myNewList = list(filter(lambda x: x % 2 != 1, myInputsList)) #check if an element is odd. Then filter out only even ones.
print(myNewList)

[2, 42, 568, 0]

We can re-create the list of functions that we created before by using lambda expressions.

In [106]:
print_functions = [
    print, #built-int function
    lambda inputString: print(inputString[::-1]), #create a single line function definition
    lambda inputString: print(inputString[:len(inputString)//2]) #create a single line function definition
] 

for func in print_functions: #calling multiple different functions with a single input
    func("Hello World!")

Hello World!
!dlroW olleH
Hello

## Pandas DataFrames Functions
Docs: https://pandas.pydata.org/pandas-docs/stable/reference/frame.html

## Pandas.apply()
Apply a function to each row/column in a Dataframe

DataFrame.apply(self, func, axis=0, raw=False, result_type=None, args=(), **kwds)<br/>
func*: Function to be applied to each column or row.<br/> 
*axis*: Axis along which the function is applied in dataframe. Default value 0.
If axis = 0 then it applies function to each column.
If axis = 1 then it applies function to each row.<br/>
*args*: tuple, list etc. of arguments to passed to function.

More on the help file:

In [136]:
import pandas as pd

Let's create a simple dataframe

In [137]:
data = {
    'name': ['John', 'Jane', 'Mike', 'Sarah', 'David', 'Emma'],
    'salary_20': np.random.randint(50_000,150_000,6),
    'salary_25': np.random.randint(55_000,155_000,6),
    'salary_30': np.random.randint(60_000,160_000,6),
    'salary_35': np.random.randint(65_000,165_000,6)
}
 
df = pd.DataFrame(data)
df

    name  salary_20  salary_25  salary_30  salary_35
0   John      52967      69713     150484     126651
1   Jane      61837      99156     132519      72487
2   Mike      74518     115085     156789     116581
3  Sarah     144681     118069     130428     137931
4  David     113803     126896     110373     139230
5   Emma      70972      77596     152254      87205

In [138]:
df.set_index('name',inplace=True)
df

       salary_20  salary_25  salary_30  salary_35
name
John       52967      69713     150484     126651
Jane       61837      99156     132519      72487
Mike       74518     115085     156789     116581
Sarah     144681     118069     130428     137931
David     113803     126896     110373     139230
Emma       70972      77596     152254      87205

In [147]:
df['salary_20']

name
John      52967
Jane      61837
Mike      74518
Sarah    144681
David    113803
Emma      70972
Name: salary_20, dtype: int32

Let's create our own function and apply it to each row or each column in the dataframe.

In [139]:
def get_max_min_diff(values): #defining the function input as iterable (i.e. list, tuple etc.)
    return np.max(values) - np.min(values)

get_max_min_diff(list([1,2,4,10])) #returns the sum of elements

9

In [142]:
get_max_min_diff((1,2,3,5)) #returns the sum of elements

4

Let's apply the function to each column and row of the dataframe

In [150]:
ps = df.apply(get_max_min_diff) #apply our sum function to each column (i.e return sum of each column)
ps #returns a pandas series

salary_20    91714
salary_25    57183
salary_30    46416
salary_35    66743
dtype: int64

In [151]:
ps = df.apply(lambda x: np.max(x) - np.min(x), axis=1) #apply our sum function to each row (i.e return sum of each column)
ps #returns a pandas series

name
John     97517
Jane     70682
Mike     82271
Sarah    26612
David    28857
Emma     81282
dtype: int64

We could achieve the same results with lambda functions

In [152]:
sum((1,2,3,5))

11

In [153]:
ps = df.apply(sum, axis = 1) #just use Python built-in function
ps

name
John     399815
Jane     365999
Mike     462973
Sarah    531109
David    490302
Emma     388027
dtype: int64

In [154]:
new_df = df.apply(lambda x: sum(x), axis = 1) # returns a pandas series
new_df

name
John     399815
Jane     365999
Mike     462973
Sarah    531109
David    490302
Emma     388027
dtype: int64

In [157]:
df.median(axis=1)

name
John      98182.0
Jane      85821.5
Mike     115833.0
Sarah    134179.5
David    120349.5
Emma      82400.5
dtype: float64

We could achieve the same by a built-in function in Python or in any library

In [158]:
import numpy as np

ps = df.apply(np.sum) #use sum function from numpy library
ps

salary_20    518778
salary_25    606515
salary_30    832847
salary_35    680085
dtype: int64

If we want to modify each entry in the dataframe, we would choose another pandas built-in function ".applymap()"

## Pandas.applymap()
This function applies a function that accepts and returns a scalar to every element of a dataframe. It returns a transformed dataframe.

DataFrame.applymap(self, func)<br/>
*func*: Python function, returns a single value from a single value.

More on the help file.

In [162]:
df.applymap(lambda x: np.log(x))

       salary_20  salary_25  salary_30  salary_35
name
John   10.877424  11.152142  11.921612  11.749191
Jane   11.032257  11.504450  11.794481  11.191163
Mike   11.218796  11.653426  11.962656  11.666342
Sarah  11.882287  11.679024  11.778577  11.834509
David  11.642224  11.751123  11.611621  11.843883
Emma   11.170041  11.259271  11.933305  11.376017

In [164]:
np.log(None)

TypeError: loop of ufunc does not support argument 0 of type NoneType which has no callable log method

In [163]:
help(df.applymap)

Help on method applymap in module pandas.core.frame:

applymap(func: 'PythonFuncType', na_action: 'str | None' = None, **kwargs) -> 'DataFrame' method of pandas.core.frame.DataFrame instance
    Apply a function to a Dataframe elementwise.

    This method applies a function that accepts and returns a scalar
    to every element of a DataFrame.

    Parameters
    ----------
    func : callable
        Python function, returns a single value from a single value.
    na_action : {None, 'ignore'}, default None
        If ‘ignore’, propagate NaN values, without passing them to func.

        .. versionadded:: 1.2

    **kwargs
        Additional keyword arguments to pass as keywords arguments to
        `func`.

        .. versionadded:: 1.3.0

    Returns
    -------
    DataFrame
        Transformed DataFrame.

    See Also
    --------
    DataFrame.apply : Apply a function along input axis of DataFrame.

    Examples
    --------
    >>> df = pd.DataFrame([[1, 2.12], [3.356, 4.567]])
    >>> df
           0      1
    0  1.000  2.120
    1  3.356  4.567

    >>> df.applymap(lambda x: len(str(x)))
       0  1
    0  3  4
    1  5  5

    Like Series.map, NA values can be ignored:

    >>> df_copy = df.copy()
    >>> df_copy.iloc[0, 0] = pd.NA
    >>> df_copy.applymap(lambda x: len(str(x)), na_action='ignore')
         0  1
    0  NaN  4
    1  5.0  5

    Note that a vectorized version of `func` often exists, which will
    be much faster. You could square each number elementwise.

    >>> df.applymap(lambda x: x**2)
               0          1
    0   1.000000   4.494400
    1  11.262736  20.857489

    But it's better to avoid applymap in that case.

    >>> df ** 2
               0          1
    0   1.000000   4.494400
    1  11.262736  20.857489

In [195]:
new_df = df.applymap(lambda x: x ** 2) # returns a new transformed dataframe with powers of each entry
new_df

         salary_20    salary_25    salary_30    salary_35
name
John    2805503089   4859902369  22645434256  16040475801
Jane    3823814569   9831912336  17561285361   5254365169
Mike    5552932324  13244557225  24582790521  13591129561
Sarah  20932591761  13940288761  17011463184  19024960761
David  12951122809  16102594816  12182199129  19384992900
Emma    5037024784   6021139216  23181280516   7604712025

In [193]:
df = df.astype('int64')

In [194]:
df ** 2 # this would also return the same. but you'll see the necessity of applymap in the following examples

         salary_20    salary_25    salary_30    salary_35
name
John    2805503089   4859902369  22645434256  16040475801
Jane    3823814569   9831912336  17561285361   5254365169
Mike    5552932324  13244557225  24582790521  13591129561
Sarah  20932591761  13940288761  17011463184  19024960761
David  12951122809  16102594816  12182199129  19384992900
Emma    5037024784   6021139216  23181280516   7604712025

Let's take a look at nba dataframe.

In [196]:
nba = pd.read_csv("https://media.geeksforgeeks.org/wp-content/uploads/nba.csv") 
nba_new = nba[:7] #create a new dataframe with 7 rows of nba
nba_new

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0
5,Amir Johnson,Boston Celtics,90.0,PF,29.0,6-9,240.0,NaN,12000000.0
6,Jordan Mickey,Boston Celtics,55.0,PF,21.0,6-8,235.0,LSU,1170960.0

In [197]:
nba_new.applymap(lambda x: len(str(x))) #convert each entry into string and return its length

   Name  Team  Number  Position  Age  Height  Weight  College  Salary
0    13    14       3         2    4       3       5        5       9
1    11    14       4         2    4       3       5        9       9
2    12    14       4         2    4       3       5       17       3
3    11    14       4         2    4       3       5       13       9
4    13    14       3         2    4       4       5        3       9
5    12    14       4         2    4       3       5        3      10
6    13    14       4         2    4       3       5        3       9

What if you desire to apply a function to each entry of a specific column of a dataframe?

In [209]:
nba_new[['Number']]

   Number
0     0.0
1    99.0
2    30.0
3    28.0
4     8.0
5    90.0
6    55.0

In [210]:
nba_new

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0
5,Amir Johnson,Boston Celtics,90.0,PF,29.0,6-9,240.0,NaN,12000000.0
6,Jordan Mickey,Boston Celtics,55.0,PF,21.0,6-8,235.0,LSU,1170960.0

In [213]:
nba_new['Name'].apply(lambda x: str(x).replace(" ", "")) #remove white space from a string

0    AveryBradley
1      JaeCrowder
2     JohnHolland
3      R.J.Hunter
4    JonasJerebko
5     AmirJohnson
6    JordanMickey
Name: Name, dtype: object

In [216]:
nba_new[['Number','Age']].applymap(lambda x:round(x)) #round each entry in Age column

   Number  Age
0       0   25
1      99   25
2      30   27
3      28   22
4       8   29
5      90   29
6      55   21

In [217]:
nba_new[['Number','Age']].applymap(round) #round each entry in Age column

   Number  Age
0       0   25
1      99   25
2      30   27
3      28   22
4       8   29
5      90   29
6      55   21